Revit 2027 API
IConnector.Origin Property
The location of the connector in family document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
XYZ Origin { get; }
ReadOnly Property Origin As XYZ
	Get
property XYZ^ Origin {
	XYZ^ get ();
}
abstract Origin : XYZ with get
Property Value
XYZ
Remarks
This property is used to retrieve the origin of the connector.
See Also
Reference
IConnector Interface
Autodesk.Revit.DB Namespace